# **DataFrame**

- Combination of series

In [26]:
import pandas as pd
import numpy as np

In [27]:
data = {
    "Name" : ["Tejas", "Akash", "Suraj"],
    "Age" : [24, 23, 25],
    "City" : ["Nagpur", "Pune", "Akola"],
    "Salary" : [170000, 130000, 120000]
}

df = pd.DataFrame(data)
df

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [28]:
data_list = [
    ["Tejas", 24, "Nagpur", 170000],
    ["Akash", 23, "Pune", 130000],
    ["Suraj", 25, "Akola", 120000]
]
df1 = pd.DataFrame(data_list)
columns = ["Name", "Age", "City", "Salary"]
df1 = pd.DataFrame(data_list, columns=columns)
df1

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

- Selection and Indexing of Columns

In [29]:
df1

    Name  Age    City  Salary
0  Tejas   24  Nagpur  170000
1  Akash   23    Pune  130000
2  Suraj   25   Akola  120000

In [30]:
df1[["Name", "City"]]

    Name    City
0  Tejas  Nagpur
1  Akash    Pune
2  Suraj   Akola